[Killed] BlockStatement
src/components/person.js:14:26
  */
 
 export class Person {
-  constructor(name, age) {
-    if (typeof name !== 'string' || name.trim() === '') {
-      throw new Error('Invalid name');
-    }
-    if (typeof age !== 'number' || age < 0) {
-      throw new Error('Invalid age');
-    }
-    this.name = name.trim();
-    this.age = age;
-  }
+  constructor(name, age) {}
 
   getGreeting() {
killedBy: Person Component Tests Property-Based Tests should always include the name and age in the greeting
statusReason: Error: Property failed after 1 tests
{ seed: 238947822, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/components/person.js:18:45
     if (typeof name !== 'string' || name.trim() === '') {
       throw new Error('Invalid name');
     }
-    if (typeof age !== 'number' || age < 0) {
-      throw new Error('Invalid age');
-    }
+    if (typeof age !== 'number' || age < 0) {}
     this.name = name.trim();
     this.age = age;
killedBy: Person should throw error for invalid age
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid age"

Received function did not throw

[Killed] StringLiteral
src/components/person.js:19:23
       throw new Error('Invalid name');
     }
     if (typeof age !== 'number' || age < 0) {
-      throw new Error('Invalid age');
+      throw new Error("");
     }
     this.name = name.trim();
killedBy: Person should throw error for invalid age
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid age"
Received message:   ""

      76 |         } else {
      77 |           stryCov_9fa48("22");
    > 78 |           throw new Error(stryMutAct_9fa48("23") ? "" : (stryCov_9fa48("23"), 'Invalid age'));

[Killed] ConditionalExpression
src/components/person.js:34:12
   }
 
   canVote() {
-    return this.age >= 18;
+    return false;
   }
 
killedBy: Person Component Tests Property-Based Tests should correctly determine voting eligibility based on age
statusReason: Error: Property failed after 1 tests
{ seed: -1443720620, path: "0:1:1:0:0", endOnFailure: true }
Counterexample: [18]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
