[Killed] BlockStatement
src/utils/utils.js:13:27
  * - Or: Rename + fully reimplement before production use.
  */
 
-export function add(a, b) {
-  return a + b;
-}
+export function add(a, b) {}
 
 export function tellBirthday(person) {
killedBy: Property-based tests for utils adding zero is identity
statusReason: Error: Property failed after 1 tests
{ seed: -996478950, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/utils/utils.js:14:10
  */
 
 export function add(a, b) {
-  return a + b;
+  return a - b;
 }
 
killedBy: Property-based tests for utils addition is commutative
statusReason: Error: Property failed after 1 tests
{ seed: 113409476, path: "0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 32 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/utils/utils.js:17:38
   return a + b;
 }
 
-export function tellBirthday(person) {
-  return `${person.introduce()} I was born in ${person.getBirthYear()}.`;
-}
+export function tellBirthday(person) {}
 
killedBy: Utils tellBirthday should return a descriptive string using person methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/utils/utils.js:18:10
 }
 
 export function tellBirthday(person) {
-  return `${person.introduce()} I was born in ${person.getBirthYear()}.`;
+  return ``;
 }
 
killedBy: Utils tellBirthday should return a descriptive string using person methods
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
